config/cf/AccumulationRegisters/Комплектация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>Комплектация</Name>
			<Comment>// Комплекткация оборудрвания (составы комплектов)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КарточкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КарточкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.КарточкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

config/cf/AccumulationRegisters/Остатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>Остатки</Name>
			<Comment>// Остатки оборудования</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.КарточкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КарточкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

config/cf/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АмортизационнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АмортизационныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРасчетПотребностейВключатьАналоги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГарантияМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКОФ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбщероссийскийКлассификаторОсновныхФондов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальныйОстаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКартинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/CommonForms/ФормаСоставКомплекта/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Номенклатура") Тогда
		СтруктураНоменклатура 	= Параметры.Номенклатура.Номенклатура;
		НоменклатураИзКомплекта = ?(ЗначениеЗаполнено(СтруктураНоменклатура.КарточкаНоменклатуры),СтруктураНоменклатура.КарточкаНоменклатуры,
		СтруктураНоменклатура.Номенклатура);
	КонецЕсли;
	
	Если Параметры.Свойство("Комплект") Тогда
		Комплект = Параметры.Комплект;		
	КонецЕсли;
	
	Если Параметры.Свойство("СвернутыйКомплект") Тогда		
		СвернутыйКомплект = Параметры.СвернутыйКомплект;
	КонецЕсли;
	
	Если Параметры.Свойство("Период") Тогда
		Период = Параметры.Период;
	КонецЕсли;
	
	Если СтруктураНоменклатура.Свойство("ЕдиницаИзмерения") Тогда
		ЕдиницаИзмерения = СтруктураНоменклатура.ЕдиницаИзмерения;
	КонецЕсли;
	
	ВывестиДеревоНоменклатуры();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеITОтделом8УФКлиент.РазвернутьДеревоНоменклатуры(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Добавить(Команда)
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ДобавитьКомплект",			  Истина);
	СтруктураВозврата.Вставить("СвернутыйКомплект",СвернутыйКомплект);
	СтруктураВозврата.Вставить("Номенклатура",				Комплект);
	СтруктураВозврата.Вставить("ЕдиницаИзмерения",	ЕдиницаИзмерения);
	Закрыть(СтруктураВозврата);
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ДобавитьКомплект", Ложь);
	Закрыть(СтруктураВозврата);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточку(Команда)
	ТекущаяСтрока = Элементы.ДеревоНоменклатуры.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущаяСтрока.КарточкаНоменклатуры) Тогда
		ПоказатьЗначение(,ТекущаяСтрока.КарточкаНоменклатуры);	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНоменклатуру(Команда)
	Если ДеревоНоменклатуры.ПолучитьЭлементы().Количество()>0 Тогда
		ТекущаяСтрока = Элементы.ДеревоНоменклатуры.ТекущиеДанные;
		Если ТекущаяСтрока = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
			ПоказатьЗначение(,ТекущаяСтрока.Номенклатура);	
		КонецЕсли;
	Иначе
		ПоказатьЗначение(,НоменклатураИзКомплекта);					
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура получает и выводит комплект в форму.
//
&НаСервере
Процедура ВывестиДеревоНоменклатуры()
	
	ПолучитьКомплект();
	КартинкаНоменклатуры = УправлениеITОтделом8УФПовтИсп.ПолучитьНавСсылкуНоменклатуры(НоменклатураИзКомплекта); 
	// Номенклатура не является частью комплекта.
	Если ДеревоНоменклатурыТЗ.Количество() = 1
		И (НоменклатураИзКомплекта = ДеревоНоменклатурыТЗ[0].КарточкаНоменклатуры 
        ИЛИ	НоменклатураИзКомплекта = ДеревоНоменклатурыТЗ[0].Номенклатура)	Тогда		
		Заголовок 									= НСтр("ru = 'Найдена номенклатура'");
		Элементы.Добавить.Заголовок 				= НСтр("ru = 'Добавить'");
		Элементы.ДекорацияЧастьКомплекта.Заголовок 	= НСтр("ru = 'не входит ни в один комплект.'");
		Элементы.ОткрытьКарточку.Видимость 			= Ложь;
		Элементы.ДекорацияПустаяКнопка.Видимость 	= Истина;
	Иначе
		ТЗ = Новый ТаблицаЗначений;
		ТЗ = ДеревоНоменклатурыТЗ.Выгрузить();
		Для Каждого Строки Из ТЗ Цикл
			Строки.НавСсылка = УправлениеITОтделом8УФПовтИсп.ПолучитьНавСсылкуНоменклатуры(Строки.Номенклатура);
		КонецЦикла;		
		ДЗ = ДанныеФормыВЗначение(ДеревоНоменклатуры, Тип("ДеревоЗначений"));
		ДЗ.Строки.Очистить();		
		УправлениеITОтделом8УФ.ВывестиДеревоНоменклатуры(ДЗ, ТЗ);
		ЗначениеВДанныеФормы(ДЗ, ДеревоНоменклатуры);			
	КонецЕсли;	
КонецПроцедуры

// Функция получает данные о комплекте.
//
&НаСервере
Функция ПолучитьКомплект()
	Номенклатура = Комплект;	
	НайденнаяНоменклатура = Новый Структура;		
	Если Не Номенклатура.ВидНоменклатуры.ВестиУчетПоКарточкамНоменклатуры Тогда
		НайденнаяНоменклатура.Вставить("Номенклатура",			Номенклатура);
		НайденнаяНоменклатура.Вставить("КарточкаНоменклатуры",	ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
		НайденнаяНоменклатура.Вставить("ЕдиницаИзмерения", 		Номенклатура.ЕдиницаИзмерения);
	Иначе	
		НайденнаяНоменклатура.Вставить("Номенклатура",			Номенклатура.Владелец);
		НайденнаяНоменклатура.Вставить("КарточкаНоменклатуры",	Номенклатура);
		НайденнаяНоменклатура.Вставить("ЕдиницаИзмерения", 		Номенклатура.Владелец.ЕдиницаИзмерения);
	КонецЕсли;
	
	НоваяСтрока = ДеревоНоменклатурыТЗ.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока,НайденнаяНоменклатура);
	ЗаполнитьПодчиненнуюНоменклатуру(Период,НоваяСтрока.КарточкаНоменклатуры);		
КонецФункции 

// Функция возвращает подчиненную номенклатуру.
//
&НаСервере
Функция ЗаполнитьПодчиненнуюНоменклатуру(Период, НоменклатураВладелец)
	
	Запрос = Новый Запрос;	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КомплектацияОстатки.Комплект,
	|	КомплектацияОстатки.Партия КАК Партия,
	|	КомплектацияОстатки.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрНакопления.Комплектация.Остатки(&Период, Комплект = &Партия) КАК КомплектацияОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	ОстаткиОстатки.Партия,
	|	ОстаткиОстатки.Номенклатура
	|ИЗ
	|	РегистрНакопления.Остатки.Остатки(&Период, Партия = &Партия) КАК ОстаткиОстатки";	
    
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Партия", НоменклатураВладелец);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ТипЗнч(Выборка.Номенклатура) = Тип("СправочникСсылка.КарточкиНоменклатуры") Тогда			
			Номенклатура			= Выборка.Номенклатура.Владелец;
			КарточкаНоменклатуры	= Выборка.Номенклатура; 			
		Иначе
			
			Номенклатура			= Выборка.Номенклатура;
			КарточкаНоменклатуры	= УправлениеITОтделом8УФПовтИсп.ПолучитьКарточкуНеВедетсяУчетПоКарточкамНоменклатуры(Выборка.Номенклатура); 			
		КонецЕсли;
		
		ПодчиненнаяНоменклатура = Новый Структура;
		ПодчиненнаяНоменклатура.Вставить("Номенклатура",		Номенклатура);				
		ПодчиненнаяНоменклатура.Вставить("Партия", 				Выборка.Партия);
		ПодчиненнаяНоменклатура.Вставить("КарточкаНоменклатуры",КарточкаНоменклатуры);
		ПодчиненнаяНоменклатура.Вставить("Комплект",			?(НоменклатураВладелец = Номенклатура, Справочники.КарточкиНоменклатуры.ПустаяСсылка(), НоменклатураВладелец));
		
		ПодчиненнаяНоменклатура.Вставить("ЕдиницаИзмерения", 	Номенклатура.ЕдиницаИзмерения);		
		НоваяСтрока					= ДеревоНоменклатурыТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ПодчиненнаяНоменклатура);		
		
		Если СвернутыйКомплект Тогда Продолжить
		Иначе	
			ЗаполнитьПодчиненнуюНоменклатуру(Период, ПодчиненнаяНоменклатура.КарточкаНоменклатуры);
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции 

#КонецОбласти
